OpenFOAM/OpenFoam2106/cavity2/cavity/0/E
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      E;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
                // kg, m , s , K , mol , A, Light(?)
dimensions      [1 1 -3 0 0 -1 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        /*
        type            fixedValue;
        value           uniform (1 0 0);
        */
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    symmetry
    {
     //   type            symmetry;
             type            zeroGradient;

    }

    fixedWalls
    {
        type            zeroGradient;
    }

    potentialWall // treated same as fixedWalls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
